In [19]:
import pandas as pd
import numpy as np

### 1. Write a Pandas program to create and display a one-dimensional array-like object containing an array of data using Pandas module.

In [2]:
a = pd.Series([0,1,2,3,4,5])
a

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64

### 2. Write a Pandas program to convert a Panda module Series to Python list and it's type.

In [5]:
print(type(a))
a_lst = list(a)
print(a_lst)
print(type(a_lst))

<class 'pandas.core.series.Series'>
[0, 1, 2, 3, 4, 5]
<class 'list'>

### 3. Write a Pandas program to compare the elements of the two Pandas Series.

In [8]:
a = pd.Series([0,1,2,3,4,5])
b = pd.Series([0,2,2,3,3,5])

a==b

0     True
1    False
2     True
3     True
4    False
5     True
dtype: bool

### 4. Write a Pandas program to change the data type of given a column or a Series.

In [13]:
b = b.astype(str)
b

0    0
1    2
2    2
3    3
4    3
5    5
dtype: object

### 5. Write a Pandas program to get the powers of an array values element-wise. 
#### Note: First array elements raised to powers from second array

In [16]:
a = pd.Series([1,2,3,4,5])
b = pd.Series([2,3,3,2,2])

a ** b

0     1
1     8
2    27
3    16
4    25
dtype: int64

### 6. Write a Pandas program to get the first 3 rows of a given DataFrame. 
#### Sample Python dictionary data and list labels: 

 ####  exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], 
 ####  'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 
 ####  'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 
 ####  'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']} 
 ####  labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [21]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data, index=labels)
df.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

### 7. Write a Pandas program to display the default index and set a column as an Index in a given dataframe.

In [28]:
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [29]:
df.set_index('name', inplace=True)
df

           score  attempts qualify
name
Anastasia   12.5         1     yes
Dima         9.0         3      no
Katherine   16.5         2     yes
James        NaN         3      no
Emily        9.0         2      no
Michael     20.0         3     yes
Matthew     14.5         1     yes
Laura        NaN         1      no
Kevin        8.0         2      no
Jonas       19.0         1     yes

### 8. Write a Pandas program to display the default index and set a column as an Index in a given dataframe and then reset the index

In [31]:
df.reset_index(inplace = True)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

### 9. Write a Pandas program to create a dataframe indexing by date and time.

In [50]:
dt_range = pd.date_range(start ='2024-07-05 02:00:00', freq ='min', periods = 10) 
df_dt = pd.DataFrame({"Sale_amt":[100, 110, 117, 150, 112, 99, 129, 135, 140, 150]},index = dt_range)

In [51]:
df_dt

                     Sale_amt
2024-07-05 02:00:00       100
2024-07-05 02:01:00       110
2024-07-05 02:02:00       117
2024-07-05 02:03:00       150
2024-07-05 02:04:00       112
2024-07-05 02:05:00        99
2024-07-05 02:06:00       129
2024-07-05 02:07:00       135
2024-07-05 02:08:00       140
2024-07-05 02:09:00       150

### 10. Write a Pandas program to create a dataframe and set a title or name of the index column.

In [32]:
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [33]:
df = df.rename_axis("Index")
df

            name  score  attempts qualify
Index
0      Anastasia   12.5         1     yes
1           Dima    9.0         3      no
2      Katherine   16.5         2     yes
3          James    NaN         3      no
4          Emily    9.0         2      no
5        Michael   20.0         3     yes
6        Matthew   14.5         1     yes
7          Laura    NaN         1      no
8          Kevin    8.0         2      no
9          Jonas   19.0         1     yes

### 11. Write a Pandas program to select a specific row of given series/dataframe by integer index.

In [34]:
df.iloc[0]

name        Anastasia
score            12.5
attempts            1
qualify           yes
Name: 0, dtype: object